# BIOF 440 Homework: Week 2

## Instructions

This homework must be done on a Jupyter notebook, either through JupyterLab or Notebook. The submission will consist of **2 files**; both files are required for complete submission. 

1. The homework will be provided as a `ipynb` file, to be opened in JupyterLab or Jupyter Notebook. This file must be edited to include required code, run within the _biof440_ environment to produce outputs for code, and submitted.
1. The final `ipynb` file, after all your work is done, must be converted to a HTML file using `File > Export Notebook As...` in JupyterLab or `File > Download as..` in Jupyter Notebook. Check that this HTML file contains all the outputs required from the assignment. This file needs to be submitted as well.
1. Please submit both files using the naming convention `BIOF440_HW2_Lastname.ipynb` and `BIOF440_HW2_Lastname.html`, replacing "Lastname" with your last name/surname/family name.

-----

For this class, please create a folder named `BIOF440` on your computer where all the material will reside, and within that folder create a sub-folder named `data` where you will store data sets used in class. 

All your deliverables should be written in the `BIOF440` folder, so that your code will be consistent with mine in terms of reading data, and will make my life correcting your homework more reasonable. If I have to go through hoops to try and run your notebook to reproduce your homework, I will deduct **5 points** from the homework. To this end, **ensure that you're running the Jupyter notebook using the biof440 environment, so that we don't have issues with packages not being installed**. Reach out on Slack if you have questions.

Each full question is **30 points**. You will get full credit if all the parts are done correctly. Extra credit problems will allow you to have a score of more than 100% for this homework.

## Question 1

### 1 (A)

In the following code chunk, import the packages `numpy` and `pandas` using the usual aliases `np` and `pd` respectively.

In [72]:
import numpy as np
import pandas as pd

### 1 (B)

We spoke of the example data sets denoted table1, table2, table3, table4a, table4b and table5 (p. 63 of the pandas slides). All the files are available on Canvas and should be downloaded to the `data` folder described above. Read these 6 files into a dictionary (`dict`) object named `tbl_data`, with keys being the names listed earlier here, and the values being the actual data, using a `for-loop` and `pandas` functions. Show your code below.

In [73]:
from glob import glob
filenames = sorted(glob('data/table*.csv')) 
tbl_data = dict(zip([i.replace('data/', '').replace('.csv', '') for i in filenames], [pd.read_csv(f) for f in filenames]))

### 1 (C)

Write why each of table1, table2, table3, (table4a + table4b) and table5 are or are not tidy, and, if not, how would you transform them to make them tidy.

In [21]:
tbl_data['table1'].head()

       country  year   cases  population
0  Afghanistan  1999     745    19987071
1  Afghanistan  2000    2666    20595360
2       Brazil  1999   37737   172006362
3       Brazil  2000   80488   174504898
4        China  1999  212258  1272915272

***Table 1*** *is tidy because it satisfied all requirements for tidy data:*

1) *Each row is one observation*
2) *Each column is one variable*
3) *Each set of observational unit forms one table*

In [74]:
tbl_data['table2'].head()

       country  year        type     count
0  Afghanistan  1999       cases       745
1  Afghanistan  1999  population  19987071
2  Afghanistan  2000       cases      2666
3  Afghanistan  2000  population  20595360
4       Brazil  1999       cases     37737

***Table 2*** *is not tidy because the following requirement is unsatisfied:*

2) *Each column is one variable*

*This can be fixed by making the table wider and making it reseble* `table1`:

![](https://d33wubrfki0l68.cloudfront.net/8350f0dda414629b9d6c354f87acf5c5f722be43/bcb84/images/tidy-8.png)

In [28]:
tbl_data['table3'].head()

       country  year               rate
0  Afghanistan  1999       745/19987071
1  Afghanistan  2000      2666/20595360
2       Brazil  1999    37737/172006362
3       Brazil  2000    80488/174504898
4        China  1999  212258/1272915272

***Table 3*** *is not tidy because the following requirement is unsatisfied:*

2) *Each column is one variable*

*This can be fixed by making the table wider, splitting the* `rate` *column and making it reseble* `table1`:

![](https://d33wubrfki0l68.cloudfront.net/f6fca537e77896868fedcd85d9d01031930d76c9/637d9/images/tidy-17.png)

In [29]:
tbl_data['table4a'].head()

       country    1999    2000
0  Afghanistan     745    2666
1       Brazil   37737   80488
2        China  212258  213766

In [30]:
tbl_data['table4b'].head()

       country        1999        2000
0  Afghanistan    19987071    20595360
1       Brazil   172006362   174504898
2        China  1272915272  1280428583

***Tables 4a and 4b*** *is not tidy because the following requirements are unsatisfied:*

1) *Each row is one observation*
2) *Each column is one variable*
3) *Each set of observational unit forms one table*

*This can be fixed by pivoting the tables wider (example below), and joining the two on the* `country` *and* `year` *columns, making it resemble* `table1`:

![](https://d33wubrfki0l68.cloudfront.net/3aea19108d39606bbe49981acda07696c0c7fcd8/2de65/images/tidy-9.png)

In [75]:
tbl_data['table5'].head()

       country  century  year               rate
0  Afghanistan       19    99       745/19987071
1  Afghanistan       20     0      2666/20595360
2       Brazil       19    99    37737/172006362
3       Brazil       20     0    80488/174504898
4        China       19    99  212258/1272915272

***Table 5*** *is not tidy because the following requirement is unsatisfied:*

2) *Each column is one variable*

*This can be fixed by combining the* `century` and `year` columns, and spliting the* `rate` *column, making it resemble* `table1`:

![](https://d33wubrfki0l68.cloudfront.net/3d98d3ba019fed3f9ee328284568d4508e479ef8/0b3e6/images/tidy-18.png)

![](https://d33wubrfki0l68.cloudfront.net/f6fca537e77896868fedcd85d9d01031930d76c9/637d9/images/tidy-17.png)

## Question 2

### 2 (A)

Read in to Python the gapminder dataset. Note from the slides how to read it in, since it is tab-delimited. Call it `gapm`

In [76]:
gapm = pd.read_csv('data/gapminder.tsv', sep='\t')
gapm.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

### 2 (B)

We want to create the following plot:

![](https://www.araastat.com/BIOF440/assignments/week2/bar1.png)

To create this we need to get our data in shape!

First, find the average life expectancy by continent in 2007. Make sure your result is a `DataFrame` and not a `Series` by appropriate use of `reset_index`.

In [77]:
gapm.groupby('continent').agg({'lifeExp': ['mean']})

             lifeExp
                mean
continent
Africa     48.865330
Americas   64.658737
Asia       60.064903
Europe     71.903686
Oceania    74.326208

or

In [78]:
gapm.groupby(['continent'])['lifeExp'].mean().reset_index()

  continent    lifeExp
0    Africa  48.865330
1  Americas  64.658737
2      Asia  60.064903
3    Europe  71.903686
4   Oceania  74.326208

### 2 (C) 

Apply the function `sort_values` to the DataFrame created in 2(B) to re-arrange the rows in increasing order of life expectancy. Use the help features or Google to figure out how to use `sort_values`

In [79]:
gapm.groupby(['continent'])['lifeExp'].mean().reset_index().sort_values('lifeExp')

  continent    lifeExp
0    Africa  48.865330
2      Asia  60.064903
1  Americas  64.658737
3    Europe  71.903686
4   Oceania  74.326208

## Question 3

### 3 (A)

Download the files BreastCancer_Clinical.xlsx and BreastCancer_Expression.xlsx from Canvas. Read both of these data into Python, calling them `brca_clin` and `brca_expr`, respectively.

In [50]:
brca_clin = pd.read_excel('data/BreastCancer_Clinical.xlsx')
brca_expr = pd.read_excel('data/BreastCancer_Expression.xlsx')

### 3 (B)

Identify the common subject identifier in the two datasets and merge `brca_clin` with `brca_expr` using a left join, calling the result `brca`. To check, this merged dataset should have 108 rows and 41 columns

In [82]:
brca = brca_clin.merge(brca_expr, 
                       right_on='TCGA_ID',
                       left_on='Complete TCGA ID', 
                       how='left')

brca.shape

(108, 41)

### 3 (C)

Find the mean expression of the proteins NP_958782 & NP_958785 by ER status.

In [83]:
brca.groupby('ER Status')[['NP_958782', 'NP_958785']].mean().reset_index()

       ER Status  NP_958782  NP_958785
0  Indeterminate        NaN        NaN
1       Negative   0.429280   0.437703
2       Positive   0.267476   0.273189